{
    "topic": "Charles James Kirk (October 14, 1993 – September 10, 2025)",
    "source_file": "leftist.json",
    "processed_at": "2025-11-02T19:38:52.823983",
    "total_items": 9,
    "items": [
        {
            "text": "The story of Charles James Kirk's life, however short, deserves to be remembered.",
            "bias_x": 0.3692,
            "significance_y": 0.77,
            "combined_score": 0.2843,
            "color": "yellow",
            "relevant_links": []
        },
        {
            "text": "The loss of Charles James Kirk is a somber event that prompts reflection on the value of human life.",
            "bias_x": 0.3077,
            "significance_y": 0.73,
            "combined_score": 0.2246,
            "color": "yellow",
            "relevant_links": [
                {
                    "title": "Conservative activist and christian leader passes away",
                    "link": "https://www.facebook.com/groups/298549307726102/posts/2015697379344611/",
                    "snippet": "Sep 11, 2025 ... OCR: Rest In Peace Charles James Kirk October 14 1993 September 10 ... human being whose life was cut short . May Charlie Kirk be ...",
                    "trust_score": 0.3,
                    "source_type": "Facebook Group Post",
                    "extracted_content": "Log in Conservative activist and christian leader passes away Summarised by AI from the post below WE ARE CATHOLIC · Join Uchenna John Agbedo · 12 September · In Christ Alone · Oslo Gospel Choir · Farewell to Charlie Kirk Today, we mourn the loss of Charlie Kirk, a passionate conservative activist, devoted family man, and strong Christian voice. At just 31 years old, his life was tragically cut short by violence on the Utah Valley University campus. Reflections on Charlie - Faith and Conviction: Charlie was deeply rooted in his Christian faith, blending it with fervent advocacy for conservative values. - Inspiring Youth: Through Turning Point USA, he ignited a movement among young Americans, championing free speech and limited government. - Friend and Leader: Described by Vice President J.D. Vance as a true friend, generous encourager, and devoted Christian, Charlie left an indelible mark on those around him. - Family Man: He cherished his wife Erika and their two young children, embodying love and dedication May Charlie's legacy inspire unity, peaceful dialogue, and a recommitment to the values he passionately championed. May the soul of Charlie Kirk, and the soul of all the faithful departed, through the Mercy of God rest in Peace. Amen All reactions: 169 33 comments 7 shares Like Comment Share Most relevant Bernard Asika God bless his gentle soul and visit His justice on all evildoers and foulers in his murder. 7w View 1 reply Larry Michel Rest in peace 7w Leuisa Mwuese Gav Rip . The Catholic faith is always a problem to them. They make away out like but can't take away our faith. 7w See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The premature loss of a young life is a societal failure that requires collective action and political will.",
            "bias_x": 0.2769,
            "significance_y": 0.8,
            "combined_score": 0.2215,
            "color": "orange",
            "relevant_links": [
                {
                    "title": "# Life and Death of Charlie Kirk You will be missed and always ...",
                    "link": "https://www.facebook.com/groups/countrymusicuniverse/posts/25454613920793492/",
                    "snippet": "Sep 12, 2025 ... Life and Death of Charlie Kirk You will be missed and always remembered. I had to write this song as a tribute to Charlie Kirk.",
                    "trust_score": 0.3,
                    "source_type": "Social Media (Facebook Group Post)",
                    "extracted_content": "Log in Country Music Universe · Join Ricci Moore · 13 September · Life and Death of Charlie Kirk You will be missed and always remembered. I had to write this song as a tribute to Charlie Kirk. Please have a listen and if it touches your heart, please like and subscribe to my YouTube channel. https://www.youtube.com/watch?v=LWy6-N0HIR8 My thoughts and prayers go out to his family and friends. Early life & rise. Charles James \"Charlie\" Kirk was born October 14, 1993, in Arlington Heights, Illinois. He dropped out of college as a teen to build a youth-focused conservative movement and co-founded Turning Point USA (TPUSA) in 2012. Over the next decade he grew into one of the most visible voices on the American right, running a media operation (podcast, radio, social channels) and mobilizing younger voters. Role and influence. Kirk positioned TPUSA as a high-energy campus and online outreach organization. He became a close, public ally of Donald Trump and a regular presence on conservative media—his platforms helped shape youth engagement in GOP politics, and he became a polarizing national figure. The shooting and death (what we know). On September 10, 2025, Charlie Kirk was shot while speaking at an event at Utah Valley University in Orem, Utah, as part of a public “American Comeback” tour appearance. He was transported to hospital and later died of his wounds; authorities and multiple news organizations reported the fatal shooting. Law enforcement said video footage exists and that a high-powered rifle was used; investigations and searches for the suspect were reported by major outlets. Immediate aftermath & reactions. The killing drew widespread reaction across American politics and media, including condemnation of political violence, statements from public figures, and coverage emphasizing the tense climate around politicized events. As reporting has been fast-moving, details about motive and perpetrator identification were evolving in early reports. All reactions: 4 Like Comment Share See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The lack of affordable mental healthcare services may have played a role in Kirk's ultimate fate.",
            "bias_x": 0.2154,
            "significance_y": 0.8,
            "combined_score": 0.1723,
            "color": "orange",
            "relevant_links": [
                {
                    "title": "Prayers for the family of Charlie Kirk. He was answering a question ...",
                    "link": "https://www.facebook.com/groups/iloveconroe/posts/2792945411036468/",
                    "snippet": "Sep 12, 2025 ... The conversation revolves around the tragic death of Kirk, with many expressing condolences and others discussing the implications of such ...",
                    "trust_score": 0.3,
                    "source_type": "Social Media (Facebook Group Post)",
                    "extracted_content": "Log in I Love Conroe · Join Kimberly Morgan Sutton · 11 September · Prayers for the family of Charlie Kirk. He was answering a question about rampant left-wing violence in America when he was shot and murdered today. He was a follower of Jesus, a Christian man, husband, and father of two young children. I pray that if you are a listener of Charlie Kirk and Turning Point USA, you will take his positive message of truth and multiply it from here on out. That is what should be done. Charlie was on the front lines of America’s culture war, mobilizing hundreds of thousands of students on over 3,500 college and high school campuses around our country. Who is going to be the next Charlie Kirk??? Charlie Kirk was speaking at the Texas Youth Summit in The Woodlands, Texas, in September 2023, where I took this picture of him. If you are not familiar with him, he is the Founder and President of Turning Point USA, a national student movement dedicated to identifying, organizing, and empowering young people to promote the principles of free markets and limited government. With a presence on over 2,000 high school and college campuses nationwide, 250,000 student members, and over 150 full-time staff, Turning Point USA is the largest and fastest-growing conservative youth activist organization in the country. At just 26-years-old, Charlie has appeared on CNBC, Fox News and FOX Business News over 600 times, is an editor-at-large at Newsweek, and often writes columns for Fox News, The Hill, The Washington Times, Breitbart, and Daily Caller. He was named to the Forbes “30 under 30” list and was also the youngest speaker at the 2016 Republican National Convention and was the opening speaker at the 2020 RNC. He’s the author of three books, including the #1 Amazon and New York Times bestseller, The MAGA Doctrine: The Only Ideas that Will Win the Future from Broadside Books, an imprint of Harper Collins. Charlie is also the chairman of Students for Trump, which aims to activate one million new college voters through its more than 350 chapters present on campuses in battleground states in the lead up to the 2020 presidential election. In 2019, Charlie was granted an honorary doctorate from Liberty University, citing his exceptional leadership and energetic voice for conservatives. Later that year, Charlie co-founded The Falkirk Center for Faith and Liberty, a Christian think tank working to expand religious liberty and advance conservative principles in the public sphere. His social media reaches over 100 million people per month, and according to Axios, he is one of the “top 10 most engaged” Twitter handles in the world behind only President Trump among conservatives. Charlie is the host of “The Charlie Kirk Show,” which is a top-10 ranked podcast on Apple News charts, and host of the all new nationally syndicated radio show which goes by the same name. Check out Charlie's website at www.charliekirk.com. https://photos.app.goo.gl/2JaTd3MGtAJtJ5WJ6 Photo by Kimberly Morgan Sutton. #charliekirk #charliekirkshow #TurningPointUSA All reactions: 136 11 comments 1 share Like Comment Share Most relevant Tasha Guillory-Hanks 7w Kai Ballard 7w View 1 reply Devin Kelley 7w See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The premature passing of Charles James Kirk is a stark reminder of the systemic failures in our public health infrastructure.",
            "bias_x": 0.1538,
            "significance_y": 0.8,
            "combined_score": 0.123,
            "color": "orange",
            "relevant_links": [
                {
                    "title": "# Life and Death of Charlie Kirk You will be missed and always ...",
                    "link": "https://www.facebook.com/groups/countrymusicuniverse/posts/25454613920793492/",
                    "snippet": "Sep 12, 2025 ... Life and Death of Charlie Kirk You will be missed and always remembered. I had to write this song as a tribute to Charlie Kirk.",
                    "trust_score": 0.3,
                    "source_type": "Social Media (Facebook Group Post)",
                    "extracted_content": "Log in Country Music Universe · Join Ricci Moore · 13 September · Life and Death of Charlie Kirk You will be missed and always remembered. I had to write this song as a tribute to Charlie Kirk. Please have a listen and if it touches your heart, please like and subscribe to my YouTube channel. https://www.youtube.com/watch?v=LWy6-N0HIR8 My thoughts and prayers go out to his family and friends. Early life & rise. Charles James \"Charlie\" Kirk was born October 14, 1993, in Arlington Heights, Illinois. He dropped out of college as a teen to build a youth-focused conservative movement and co-founded Turning Point USA (TPUSA) in 2012. Over the next decade he grew into one of the most visible voices on the American right, running a media operation (podcast, radio, social channels) and mobilizing younger voters. Role and influence. Kirk positioned TPUSA as a high-energy campus and online outreach organization. He became a close, public ally of Donald Trump and a regular presence on conservative media—his platforms helped shape youth engagement in GOP politics, and he became a polarizing national figure. The shooting and death (what we know). On September 10, 2025, Charlie Kirk was shot while speaking at an event at Utah Valley University in Orem, Utah, as part of a public “American Comeback” tour appearance. He was transported to hospital and later died of his wounds; authorities and multiple news organizations reported the fatal shooting. Law enforcement said video footage exists and that a high-powered rifle was used; investigations and searches for the suspect were reported by major outlets. Immediate aftermath & reactions. The killing drew widespread reaction across American politics and media, including condemnation of political violence, statements from public figures, and coverage emphasizing the tense climate around politicized events. As reporting has been fast-moving, details about motive and perpetrator identification were evolving in early reports. All reactions: 4 Like Comment Share See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The loss of Charles James Kirk is a collective loss, a reminder of the human cost of our broken social systems.",
            "bias_x": 0.1231,
            "significance_y": 0.7,
            "combined_score": 0.0862,
            "color": "red",
            "relevant_links": [
                {
                    "title": "It's time to open your mind and learn more about this young man",
                    "link": "https://www.facebook.com/groups/SullivanCountyPost/posts/9324224374368688/",
                    "snippet": "Sep 29, 2025 ... Bob Kirk The sign that Charlie was a racist is that he spent the majority of his time \"prowling blacks\" (his words) and ignored most other ...",
                    "trust_score": 0.3,
                    "source_type": "Social Media (Facebook Group Post)",
                    "extracted_content": "Log in Controversy over a young man's memorial and legacy Summarised by AI from the post below SULLIVAN COUNTY POST · Join Rich Schellberg · 29 September · It’s time to open your mind and learn more about this young man Real Texas Conservative 28 September · For a generation of Black Conservatives, Charlie Kirk built more than politics — he built a community. The death of Charlie Kirk has left a generation of young Black Conservatives grieving not only the loss of an influential figure but also the man they say built a community where they felt they belonged. For many the news arrived in the most jarring of ways, text messages lighting up phones and timelines filled with a viral video of his final moments. What followed was shock, heartbreak and reflection on the complicated legacy of a man whose influence for some ran deeper than many outside his circle ever realized. To be a Black Conservative in America often means carrying a dual burden that is as social as it is political. Pew Research found that 83% of Black voters identify with or lean Democratic while 12% align with the Republican Party. Faced with such a stark divide, families can fracture, friendships may fade, and communities sometimes close their doors. For thousands who found themselves drawn to Turning Point USA or BLEXIT, Charlie Kirk offered a sense of belonging. Brandon Tatum alongside Charlie Kirk helped organize the first Young Black Leadership Summit in 2018. It was the largest gathering of Black Conservatives ever invited to the White House. Nearly 400 young people had their travel and expenses covered by Turning Point USA. For some it was their first plane ride, the first time they'd worn a suit, and their first glimpse of Washington. That summit, Tatum said, was a turning point. Source credit: Beatrice Peterson — ABC News All reactions: 23 65 comments 1 share Like Comment Most relevant Dave Clark Fuck that Racist MF. First they do is get a picture with him with a black person We don't give a fuck about this guy. Go talk to someone Latino. FOH. They gonna make us love him 3w Dave Clark We have a felonious Child Molester running the country And your worried about black people mourning fucking bigot 3w Dave Clark 3w View all 2 replies See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "We must fight for policies that ensure everyone has access to healthy food, clean water, and safe living conditions.",
            "bias_x": 0.0769,
            "significance_y": 0.7,
            "combined_score": 0.0538,
            "color": "red",
            "relevant_links": [
                {
                    "title": "Vigil for Controversial Figure Sparks Debate in Green Bay",
                    "link": "https://www.facebook.com/groups/GreenBayLlama/posts/2260136131167434/",
                    "snippet": "Sep 19, 2025 ... Brown County Supervisor Dixon Wolfe, who works for Kirk's Turning Point USA, told the younger members of the crowd to get involved in ...",
                    "trust_score": 0.3,
                    "source_type": "Facebook Group Post",
                    "extracted_content": "Log in Vigil for Controversial Figure Sparks Debate in Green Bay Summarised by AI from the post below Greater Green Bay Society of the Llama · Join GreenBay Llama · Admin · 19 September · Brown County Supervisor Dixon Wolfe, who works for Kirk's Turning Point USA, told the younger members of the crowd to get involved in politics if they want to make change in the country. \"Carry on his legacy,\" Wolfe said. \"Be bold. Be courageous.\" GREENBAYPRESSGAZETTE.COM Brown County community members gather for vigil in honor of Charlie Kirk University of Wisconsin-Green Bay senior Cerina Grauey said she wanted to bring the community together in the wake of violence. All reactions: 77 56 comments 2 shares Like Comment Share Most relevant Cody Rogers Asked for comment about pressing local issues like Brown County’s 911 dispatcher crisis, county supervisor Wolfe replied, “The what crisis in whose county? This is the first I’m hearing about this. Sounds like something you’d want to talk to one of tha… See more 6w 18 Aron Obrecht replied · 5 replies Steve Smedberg There are more words in this story than there were people attending this event. I’d love to see a story about every gathering of 50 or more people in the community. This story is being given outsized coverage. 6w 13 Shelby Katherine replied · 9 replies Sunny Lange Authoritarians pull scripture out of context to sanctify violence, nationalism, and obedience. This isn't new. Joshua 1:9 has been used by fascists in the past in a few different ways. Militarized courage, national destiny and conquest, and divine endo… See more 6w 25 Shawn Robak replied · 8 replies See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The circumstances of Kirk's death must be thoroughly investigated to ensure no negligence or malpractice occurred.",
            "bias_x": 0.0308,
            "significance_y": 0.7,
            "combined_score": 0.0216,
            "color": "red",
            "relevant_links": [
                {
                    "title": "Article | Bipartisan effort to make political violence a ... - POLITICO Pro",
                    "link": "https://subscriber.politicopro.com/article/2025/09/bipartisan-effort-to-make-political-violence-a-hate-crime-after-charlie-kirks-killing-00564674",
                    "snippet": "Sep 15, 2025 ... A GOP-led proposal to make political violence a hate crime in New Jersey is expected to have a key Democratic backer.",
                    "trust_score": 0.75,
                    "source_type": "News organization",
                    "extracted_content": "SKIP TO MAIN CONTENT Submit search Search Bar Gift article STATE Bipartisan effort to make political violence a hate crime after Charlie Kirk’s killing Republican lawmaker pushing the measure also cites violence against Pennsylvania governor and Minnesota state lawmaker. BY: DANIEL HAN | 09/15/2025 05:07 PM EDT Flowers laid by mourners of Charlie Kirk outside the U.S. Embassy in Pretoria, South Africa, on Sept. 11.Phill Magakoe/AFP via Getty Images A GOP-led proposal to make political violence a hate crime in New Jersey is expected to have a key Democratic backer. Senate Judiciary Chair Brian Stack (D) announced Monday that he will join GOP state Sen. Doug Steinhardt’s proposal to make political violence a hate crime in New Jersey — and thus subject to tougher penalties. “This bill protects people’s rights to participate in our democracy freely and without fear,” Stack said in a statement. \"By imposing tougher penalties, we are making it clear: if you use violence to punish, deter, or silence a victim from engaging in political expression or participation, there will be consequences. Enough is enough; this kind of behavior has no place in a free society.” Steinhardt announced the proposal following conservative commentator Charlie Kirk’s murder, although he has cited multiple acts of political violence against Democrats and Republicans as inspiration for the proposal — including the arson attack on Pennsylvania Gov. Josh Shapiro’s (D) residence, the assassination attempt against President Donald Trump and the murder of former Minnesota House Speaker Melissa Hortman (D). ... Continue reading this article. Comprehensive coverage in real time. Learn more Login TERMS OF SERVICE PRIVACY POLICY © 2025 POLITICO LLC"
                }
            ]
        },
        {
            "text": "The premature death of Charles James Kirk highlights the fragility of life under a capitalist system that prioritizes profit over human well-being.",
            "bias_x": 0.0,
            "significance_y": 0.8,
            "combined_score": 0.0,
            "color": "red",
            "relevant_links": [
                {
                    "title": "“This University has a turning point chapter and they had a vigil for ...",
                    "link": "https://www.facebook.com/groups/2650312661859103/posts/4204461389777548/",
                    "snippet": "Sep 23, 2025 ... This University has a turning point chapter and they had a vigil for charlie kirk on Friday. As a professor that is on the watchlist and has ...",
                    "trust_score": 0.3,
                    "source_type": "Facebook Group Post",
                    "extracted_content": "Log in Antifa, Republicans, Democrats & Independents United Against Trumpism · Join Etan Thomas · 24 September · “This University has a turning point chapter and they had a vigil for charlie kirk on Friday. As a professor that is on the watchlist and has received daily hate and death threats, for the first time in my life, I have been fearful of students and for me that breaks my heart in a way I can’t even articulate. Teaching is my favorite thing in the whole world. It wakes me up, it makes my heart go pitter patter. It is my purpose. But to be in classes where I don’t know if one of these Charlie Kirk radicalized students want to hurt me is a very different space to be in so much so that I made all my classes virtual this week. For my safety as well as the safety of a lot of my students who have been very vocal about how they feel about Charlie Kirk and his bigotry so both of us are in danger. It’s a very weird space to be in right now and I hate it” ~Angel Jones YOUTUBE.COM Professor receives death threats from Charlie Kirk Supporters Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube. All reactions: 170 33 comments 92 shares Like Comment Share Most relevant Darlene Harris But they are Christian?? 5w 9 View all 6 replies Patti Schaefer Pittenger She is being threatened, she's black. The Kirk followers are for white supremacy. 5w 4 View 1 reply Carol LeSaicherre I would classify this group of Charlie people a terrorist organization. 5w See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        }
    ]
}