{
    "topic": "Charles James Kirk (October 14, 1993 – September 10, 2025)",
    "source_file": "common.json",
    "processed_at": "2025-11-02T23:39:48.882911",
    "total_items": 3,
    "items": [
        {
            "text": "Let's offer our sincerest condolences to the family and friends of Charles James Kirk.",
            "bias_x": 0.5231,
            "significance_y": 0.9,
            "combined_score": 0.4708,
            "color": "green",
            "relevant_links": [
                {
                    "title": "Charlie Kirk - Wikipedia",
                    "link": "https://en.wikipedia.org/wiki/Charlie_Kirk",
                    "snippet": "Charles James Kirk (October 14, 1993 – September 10, 2025) was an American right-wing political activist, entrepreneur, and media personality.",
                    "trust_score": 0.75,
                    "source_type": "Encyclopedia (Wikipedia)",
                    "extracted_content": "Jump to content Main menu Search Appearance Donate Create account Log in Personal tools Toggle the table of contents Charlie Kirk 72 languages Article Talk Read View source View history Tools From Wikipedia, the free encyclopedia This article is about the American activist. For other people named Charlie or Charles Kirk, see Charles Kirk. Charlie Kirk Kirk in 2024 Born Charles James Kirk October 14, 1993 Arlington Heights, Illinois, U.S. Died September 10, 2025 (aged 31) Orem, Utah, U.S. Cause of death Assassination by gunshot Occupations Political activistauthornonprofit executivemedia personalityorganizer Years active 2012–2025 Organizations Turning Point USA Turning Point Action Political party Republican Movement Conservatism Christian nationalism Trumpism Spouse Erika Frantzve (m. 2021) Children 2 Awards Presidential Medal of Freedom (2025, posthumous) Kirk's voice Duration: 1 minute and 36 seconds. 1:36 Kirk on the influence of religion on people's behavior Recorded March 15, 2022 Signature Charles James Kirk (October 14, 1993 – September 10, 2025) was an American right-wing political activist, entrepreneur, and media personality. He co-founded the conservative student organization Turning Point USA (TPUSA) in 2012 and served as its executive director until his assassination in 2025. He published a range of books and hosted the podcast The Charlie Kirk Show. A key ally of Donald Trump, he was one of the most prominent voices of the MAGA movement within the Republican Party. Born and raised in the Chicago suburbs of Arlington Heights and Prospect Heights, Kirk became politically active in high school. He dropped out of college after one semester to focus on building Turning Point USA, which grew to encompass several affiliate groups, including Turning Point Action and Turning Point Faith. He espoused a variety of conservative stances, including opposition to abortion, gun control, DEI programs, and LGBTQ rights. Over time, he became aligned with the Christian right and began advocating for Christian nationalism. His more controversial positions included his criticism of the Civil Rights Act of 1964 and Martin Luther King Jr., as well as his promotion of COVID-19 misinformation, false claims of electoral fraud in 2020, and the white genocide conspiracy theory. On September 10, 2025, Kirk was shot and killed while speaking at a TPUSA public debate event on the Utah Valley University campus. His death garnered international attention and led to the condemnation of political violence by prominent domestic and international figures, as well as partisan dispute and recriminations. Kirk was posthumously awarded the Presidential Medal of Freedom by Trump in October. Early life and education Charles James Kirk was born on October 14, 1993, in the Chicago suburb of Arlington Heights, Illinois,[1] and raised in nearby Prospect Heights.[2] His father Robert W. Kirk is an architect who was involved in the construction of Trump Tower.[3][4] His mother Kathryn (née Smith) is a former trader at the Chicago Mercantile Exchange who subsequently worked as a mental health counselor.[5][2][3][4] He had one sibling, a younger sister Mary, who went on to become an art curator in Chicago.[6] Kirk described his parents as moderate Republicans.[2] They were active in conservative circles and his father was a major donor to the Mitt Romney 2012 presidential campaign.[1] Raised in the Presbyterian Church, Kirk was a member of the Boy Scouts of America and earned the rank of Eagle Scout.[7][8] He experienced a period of political awakening in middle school, during which he read books by economist Milton Friedman and became more attracted to the principles of the Republican Party.[2] In 2010, during his junior year at Wheeling High School, Kirk volunteered for the successful U.S. Senate campaign of Illinois Republican Mark Kirk (no relation).[9] Also during his junior year, he began listening to The Rush Limbaugh Show, a prominent conservative talk radio broadcast.[1] In his senior year, he initiated a boycott of cookies at the school's cafeteria to reverse a price increase.[2] He also wrote an essay for Breitbart News alleging liberal bias in high-school textbooks; it led to his first media appearance on Fox Business at age 17.[10][11] In 2012, Kirk applied to West Point but was rejected.[10][11] Although he was accepted that same year to Baylor University in Waco, Texas, he enrolled instead at Harper College, a community college in Palatine, Illinois. Withdrawing after one semester, he left Harper to concentrate on his work with Turning Point USA, the political group he co-founded with conservative businessman and mentor Bill Montgomery.[1][10] In 2015, Kirk enrolled part-time at King's College in New York City, taking online classes.[12] Kirk did not receive a college degree during his lifetime, a fact he noted in debates with academics and students.[13] Organizations Turning Point USA Main article: Turning Point USA Kirk speaki"
                }
            ]
        },
        {
            "text": "This event prompts us to reflect on the fragility of life and the importance of cherishing our time.",
            "bias_x": 0.4615,
            "significance_y": 0.8,
            "combined_score": 0.3692,
            "color": "green",
            "relevant_links": [
                {
                    "title": "Conservative activist and christian leader passes away",
                    "link": "https://www.facebook.com/groups/298549307726102/posts/2015697379344611/",
                    "snippet": "Sep 11, 2025 ... OCR: Rest In Peace Charles James Kirk October 14 1993 September 10 2025 Peace Your memory May you Rest blessing and your treasure. Though we ...",
                    "trust_score": 0.3,
                    "source_type": "Social Media (Facebook Group Post)",
                    "extracted_content": "Log in Conservative activist and christian leader passes away Summarised by AI from the post below WE ARE CATHOLIC · Join Uchenna John Agbedo · 12 September · In Christ Alone · Oslo Gospel Choir · Farewell to Charlie Kirk Today, we mourn the loss of Charlie Kirk, a passionate conservative activist, devoted family man, and strong Christian voice. At just 31 years old, his life was tragically cut short by violence on the Utah Valley University campus. Reflections on Charlie - Faith and Conviction: Charlie was deeply rooted in his Christian faith, blending it with fervent advocacy for conservative values. - Inspiring Youth: Through Turning Point USA, he ignited a movement among young Americans, championing free speech and limited government. - Friend and Leader: Described by Vice President J.D. Vance as a true friend, generous encourager, and devoted Christian, Charlie left an indelible mark on those around him. - Family Man: He cherished his wife Erika and their two young children, embodying love and dedication May Charlie's legacy inspire unity, peaceful dialogue, and a recommitment to the values he passionately championed. May the soul of Charlie Kirk, and the soul of all the faithful departed, through the Mercy of God rest in Peace. Amen All reactions: 169 33 comments 7 shares Like Comment Share Most relevant Adrian Gomez Eternal Light Shine Upon Him, May His Soul Rest In Peace. Amen 7w Leuisa Mwuese Gav Rip . The Catholic faith is always a problem to them. They make away out like but can't take away our faith. 7w Bernard Asika God bless his gentle soul and visit His justice on all evildoers and foulers in his murder. 7w View 1 reply See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The death of Charles James Kirk is a moment to pause and consider our own mortality.",
            "bias_x": 0.4308,
            "significance_y": 0.7,
            "combined_score": 0.3016,
            "color": "yellow",
            "relevant_links": []
        }
    ]
}