{
    "topic": "Charles James Kirk (October 14, 1993 – September 10, 2025)",
    "source_file": "rightist.json",
    "processed_at": "2025-11-02T23:39:48.882911",
    "total_items": 9,
    "items": [
        {
            "text": "This is a stark warning against the dangers of collectivism and the nanny state.",
            "bias_x": 0.9846,
            "significance_y": 0.9,
            "combined_score": 0.8861,
            "color": "violet",
            "relevant_links": []
        },
        {
            "text": "This is a patriotic loss; he was likely a good man who was betrayed by the system he loved.",
            "bias_x": 0.9077,
            "significance_y": 0.9,
            "combined_score": 0.8169,
            "color": "violet",
            "relevant_links": [
                {
                    "title": "I wrote this song as a tribute to Charlie Kirk.",
                    "link": "https://www.facebook.com/groups/1328086150680702/posts/3299864973502800/",
                    "snippet": "Sep 13, 2025 ... The conversation revolves around a tribute to a person who stood up for their beliefs and values, with comments expressing admiration and ...",
                    "trust_score": 0.5,
                    "source_type": "Unknown",
                    "extracted_content": "Log in Tribute to a person who stood up for their beliefs Summarised by AI from the post below Menaa Arkansas......Whats happening · Join Justin Robins · 14 September · I wrote this song as a tribute to Charlie Kirk. 0:00 / 5:33 Justin Robins is in Mena, AR, United States. 14 September · Turn up your sound! “Faith, Family, Country” I wrote this song to honor the life, faith, and legacy of Charlie Kirk, a husband, father, and American hero who stood boldly for God, family, and country. He taught young people to think for themselves, to ask hard questions, and to speak truth in love. Charlie believed: “If I die, I want to be remembered for courage and for my faith.” His courage, his words, and his example will never be forgotten. Though he died a martyr, his story continues to inspire millions worldwide, igniting a fire in believers to live with conviction and hope.This song is more than a tribute, it’s a reminder that Charlie’s banner of faith, family, and country still flies. #CharlieKirk #TributeSong #FaithFamilyCountry #ChristianCountryMusic #AmericanHero #LegacyOfFaithd All reactions: 34 13 comments 12 shares Like Comment Most relevant Susan Salter It's a great tribute to the family. God bless us all.WE ARE CHARLIE!!! 6w Linda Getman What lovely truth 6w View 1 reply Deborah Littlefield Well done sir 6w View 1 reply See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "This is a sad event that should prompt reflection on our own mortality.",
            "bias_x": 0.8,
            "significance_y": 0.9,
            "combined_score": 0.72,
            "color": "indigo",
            "relevant_links": []
        },
        {
            "text": "This is a clear example of the breakdown of traditional family values, which are the bedrock of a strong society.",
            "bias_x": 0.8769,
            "significance_y": 0.8,
            "combined_score": 0.7015,
            "color": "violet",
            "relevant_links": []
        },
        {
            "text": "The focus should be on compassion for his loved ones, not on political agendas.",
            "bias_x": 0.7077,
            "significance_y": 0.91,
            "combined_score": 0.644,
            "color": "blue",
            "relevant_links": []
        },
        {
            "text": "The family of Charles James Kirk deserves privacy during this painful period.",
            "bias_x": 0.7385,
            "significance_y": 0.8,
            "combined_score": 0.5908,
            "color": "indigo",
            "relevant_links": [
                {
                    "title": "Charlie Kirk - Wikipedia",
                    "link": "https://en.wikipedia.org/wiki/Charlie_Kirk",
                    "snippet": "Charles James Kirk (October 14, 1993 – September 10, 2025) was an American right-wing political activist, entrepreneur, and media personality.",
                    "trust_score": 0.75,
                    "source_type": "Encyclopedia (Wikipedia)",
                    "extracted_content": "Jump to content Main menu Search Appearance Donate Create account Log in Personal tools Toggle the table of contents Charlie Kirk 72 languages Article Talk Read View source View history Tools From Wikipedia, the free encyclopedia This article is about the American activist. For other people named Charlie or Charles Kirk, see Charles Kirk. Charlie Kirk Kirk in 2024 Born Charles James Kirk October 14, 1993 Arlington Heights, Illinois, U.S. Died September 10, 2025 (aged 31) Orem, Utah, U.S. Cause of death Assassination by gunshot Occupations Political activistauthornonprofit executivemedia personalityorganizer Years active 2012–2025 Organizations Turning Point USA Turning Point Action Political party Republican Movement Conservatism Christian nationalism Trumpism Spouse Erika Frantzve (m. 2021) Children 2 Awards Presidential Medal of Freedom (2025, posthumous) Kirk's voice Duration: 1 minute and 36 seconds. 1:36 Kirk on the influence of religion on people's behavior Recorded March 15, 2022 Signature Charles James Kirk (October 14, 1993 – September 10, 2025) was an American right-wing political activist, entrepreneur, and media personality. He co-founded the conservative student organization Turning Point USA (TPUSA) in 2012 and served as its executive director until his assassination in 2025. He published a range of books and hosted the podcast The Charlie Kirk Show. A key ally of Donald Trump, he was one of the most prominent voices of the MAGA movement within the Republican Party. Born and raised in the Chicago suburbs of Arlington Heights and Prospect Heights, Kirk became politically active in high school. He dropped out of college after one semester to focus on building Turning Point USA, which grew to encompass several affiliate groups, including Turning Point Action and Turning Point Faith. He espoused a variety of conservative stances, including opposition to abortion, gun control, DEI programs, and LGBTQ rights. Over time, he became aligned with the Christian right and began advocating for Christian nationalism. His more controversial positions included his criticism of the Civil Rights Act of 1964 and Martin Luther King Jr., as well as his promotion of COVID-19 misinformation, false claims of electoral fraud in 2020, and the white genocide conspiracy theory. On September 10, 2025, Kirk was shot and killed while speaking at a TPUSA public debate event on the Utah Valley University campus. His death garnered international attention and led to the condemnation of political violence by prominent domestic and international figures, as well as partisan dispute and recriminations. Kirk was posthumously awarded the Presidential Medal of Freedom by Trump in October. Early life and education Charles James Kirk was born on October 14, 1993, in the Chicago suburb of Arlington Heights, Illinois,[1] and raised in nearby Prospect Heights.[2] His father Robert W. Kirk is an architect who was involved in the construction of Trump Tower.[3][4] His mother Kathryn (née Smith) is a former trader at the Chicago Mercantile Exchange who subsequently worked as a mental health counselor.[5][2][3][4] He had one sibling, a younger sister Mary, who went on to become an art curator in Chicago.[6] Kirk described his parents as moderate Republicans.[2] They were active in conservative circles and his father was a major donor to the Mitt Romney 2012 presidential campaign.[1] Raised in the Presbyterian Church, Kirk was a member of the Boy Scouts of America and earned the rank of Eagle Scout.[7][8] He experienced a period of political awakening in middle school, during which he read books by economist Milton Friedman and became more attracted to the principles of the Republican Party.[2] In 2010, during his junior year at Wheeling High School, Kirk volunteered for the successful U.S. Senate campaign of Illinois Republican Mark Kirk (no relation).[9] Also during his junior year, he began listening to The Rush Limbaugh Show, a prominent conservative talk radio broadcast.[1] In his senior year, he initiated a boycott of cookies at the school's cafeteria to reverse a price increase.[2] He also wrote an essay for Breitbart News alleging liberal bias in high-school textbooks; it led to his first media appearance on Fox Business at age 17.[10][11] In 2012, Kirk applied to West Point but was rejected.[10][11] Although he was accepted that same year to Baylor University in Waco, Texas, he enrolled instead at Harper College, a community college in Palatine, Illinois. Withdrawing after one semester, he left Harper to concentrate on his work with Turning Point USA, the political group he co-founded with conservative businessman and mentor Bill Montgomery.[1][10] In 2015, Kirk enrolled part-time at King's College in New York City, taking online classes.[12] Kirk did not receive a college degree during his lifetime, a fact he noted in debates with academics and students.[13] Organizations Turning Point USA Main article: Turning Point USA Kirk speaki"
                }
            ]
        },
        {
            "text": "The community should rally around the family to provide practical and emotional support.",
            "bias_x": 0.6308,
            "significance_y": 0.88,
            "combined_score": 0.5551,
            "color": "blue",
            "relevant_links": [
                {
                    "title": "Charlie Kirk In Remembrance of Charles James Kirk (October 14 ...",
                    "link": "https://www.facebook.com/groups/537025506347845/posts/24725034947120230/",
                    "snippet": "Sep 10, 2025 ... Charlie Kirk In Remembrance of Charles James Kirk (October 14, 1993 – September 10, 2025) Shot and Killed in my home state of Utah.",
                    "trust_score": 0.3,
                    "source_type": "Social Media (Facebook Group Post)",
                    "extracted_content": "Log in Nashville area Musicians, Singers, Producers, Songwriters · Join Lamont Eddy Sr. · 11 September · Charlie Kirk In Remembrance of Charles James Kirk (October 14, 1993 – September 10, 2025) Shot and Killed in my home state of Utah. Rest In Pease Charlie, you will be missed. Condolences to the family and and loved ones left behind. https://youtu.be/FOlJn9LOSgo?si=Rea_-DyP1Syrg3Zo https://open.spotify.com/album/0ZLiMhCi3Kgazu8o2R3G2v... My Love Will Live On - Single by Lamont Eddy | Spotify Lamont Eddy · single · 2025 · 1 songs All reactions: 2 Like Comment Share See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        },
        {
            "text": "The family deserves privacy during this painful time, and the media should respect that.",
            "bias_x": 0.6,
            "significance_y": 0.84,
            "combined_score": 0.504,
            "color": "blue",
            "relevant_links": [
                {
                    "title": "Charlie Kirk - Wikipedia",
                    "link": "https://en.wikipedia.org/wiki/Charlie_Kirk",
                    "snippet": "Charles James Kirk (October 14, 1993 – September 10, 2025) was an American right-wing political activist, entrepreneur, and media personality.",
                    "trust_score": 0.75,
                    "source_type": "Encyclopedia (Wikipedia)",
                    "extracted_content": "Jump to content Main menu Search Appearance Donate Create account Log in Personal tools Toggle the table of contents Charlie Kirk 72 languages Article Talk Read View source View history Tools From Wikipedia, the free encyclopedia This article is about the American activist. For other people named Charlie or Charles Kirk, see Charles Kirk. Charlie Kirk Kirk in 2024 Born Charles James Kirk October 14, 1993 Arlington Heights, Illinois, U.S. Died September 10, 2025 (aged 31) Orem, Utah, U.S. Cause of death Assassination by gunshot Occupations Political activistauthornonprofit executivemedia personalityorganizer Years active 2012–2025 Organizations Turning Point USA Turning Point Action Political party Republican Movement Conservatism Christian nationalism Trumpism Spouse Erika Frantzve (m. 2021) Children 2 Awards Presidential Medal of Freedom (2025, posthumous) Kirk's voice Duration: 1 minute and 36 seconds. 1:36 Kirk on the influence of religion on people's behavior Recorded March 15, 2022 Signature Charles James Kirk (October 14, 1993 – September 10, 2025) was an American right-wing political activist, entrepreneur, and media personality. He co-founded the conservative student organization Turning Point USA (TPUSA) in 2012 and served as its executive director until his assassination in 2025. He published a range of books and hosted the podcast The Charlie Kirk Show. A key ally of Donald Trump, he was one of the most prominent voices of the MAGA movement within the Republican Party. Born and raised in the Chicago suburbs of Arlington Heights and Prospect Heights, Kirk became politically active in high school. He dropped out of college after one semester to focus on building Turning Point USA, which grew to encompass several affiliate groups, including Turning Point Action and Turning Point Faith. He espoused a variety of conservative stances, including opposition to abortion, gun control, DEI programs, and LGBTQ rights. Over time, he became aligned with the Christian right and began advocating for Christian nationalism. His more controversial positions included his criticism of the Civil Rights Act of 1964 and Martin Luther King Jr., as well as his promotion of COVID-19 misinformation, false claims of electoral fraud in 2020, and the white genocide conspiracy theory. On September 10, 2025, Kirk was shot and killed while speaking at a TPUSA public debate event on the Utah Valley University campus. His death garnered international attention and led to the condemnation of political violence by prominent domestic and international figures, as well as partisan dispute and recriminations. Kirk was posthumously awarded the Presidential Medal of Freedom by Trump in October. Early life and education Charles James Kirk was born on October 14, 1993, in the Chicago suburb of Arlington Heights, Illinois,[1] and raised in nearby Prospect Heights.[2] His father Robert W. Kirk is an architect who was involved in the construction of Trump Tower.[3][4] His mother Kathryn (née Smith) is a former trader at the Chicago Mercantile Exchange who subsequently worked as a mental health counselor.[5][2][3][4] He had one sibling, a younger sister Mary, who went on to become an art curator in Chicago.[6] Kirk described his parents as moderate Republicans.[2] They were active in conservative circles and his father was a major donor to the Mitt Romney 2012 presidential campaign.[1] Raised in the Presbyterian Church, Kirk was a member of the Boy Scouts of America and earned the rank of Eagle Scout.[7][8] He experienced a period of political awakening in middle school, during which he read books by economist Milton Friedman and became more attracted to the principles of the Republican Party.[2] In 2010, during his junior year at Wheeling High School, Kirk volunteered for the successful U.S. Senate campaign of Illinois Republican Mark Kirk (no relation).[9] Also during his junior year, he began listening to The Rush Limbaugh Show, a prominent conservative talk radio broadcast.[1] In his senior year, he initiated a boycott of cookies at the school's cafeteria to reverse a price increase.[2] He also wrote an essay for Breitbart News alleging liberal bias in high-school textbooks; it led to his first media appearance on Fox Business at age 17.[10][11] In 2012, Kirk applied to West Point but was rejected.[10][11] Although he was accepted that same year to Baylor University in Waco, Texas, he enrolled instead at Harper College, a community college in Palatine, Illinois. Withdrawing after one semester, he left Harper to concentrate on his work with Turning Point USA, the political group he co-founded with conservative businessman and mentor Bill Montgomery.[1][10] In 2015, Kirk enrolled part-time at King's College in New York City, taking online classes.[12] Kirk did not receive a college degree during his lifetime, a fact he noted in debates with academics and students.[13] Organizations Turning Point USA Main article: Turning Point USA Kirk speaki"
                }
            ]
        },
        {
            "text": "This is a shared human experience, reminding us of our common vulnerability.",
            "bias_x": 0.5846,
            "significance_y": 0.8,
            "combined_score": 0.4677,
            "color": "green",
            "relevant_links": [
                {
                    "title": "# Life and Death of Charlie Kirk You will be missed and always ...",
                    "link": "https://www.facebook.com/groups/countrymusicuniverse/posts/25454613920793492/",
                    "snippet": "Sep 12, 2025 ... He became a close, public ally of Donald Trump and a regular presence on conservative media—his platforms helped shape youth engagement in GOP ...",
                    "trust_score": 0.3,
                    "source_type": "Facebook Group Post",
                    "extracted_content": "Log in Country Music Universe · Join Ricci Moore · 13 September · Life and Death of Charlie Kirk You will be missed and always remembered. I had to write this song as a tribute to Charlie Kirk. Please have a listen and if it touches your heart, please like and subscribe to my YouTube channel. https://www.youtube.com/watch?v=LWy6-N0HIR8 My thoughts and prayers go out to his family and friends. Early life & rise. Charles James \"Charlie\" Kirk was born October 14, 1993, in Arlington Heights, Illinois. He dropped out of college as a teen to build a youth-focused conservative movement and co-founded Turning Point USA (TPUSA) in 2012. Over the next decade he grew into one of the most visible voices on the American right, running a media operation (podcast, radio, social channels) and mobilizing younger voters. Role and influence. Kirk positioned TPUSA as a high-energy campus and online outreach organization. He became a close, public ally of Donald Trump and a regular presence on conservative media—his platforms helped shape youth engagement in GOP politics, and he became a polarizing national figure. The shooting and death (what we know). On September 10, 2025, Charlie Kirk was shot while speaking at an event at Utah Valley University in Orem, Utah, as part of a public “American Comeback” tour appearance. He was transported to hospital and later died of his wounds; authorities and multiple news organizations reported the fatal shooting. Law enforcement said video footage exists and that a high-powered rifle was used; investigations and searches for the suspect were reported by major outlets. Immediate aftermath & reactions. The killing drew widespread reaction across American politics and media, including condemnation of political violence, statements from public figures, and coverage emphasizing the tense climate around politicized events. As reporting has been fast-moving, details about motive and perpetrator identification were evolving in early reports. All reactions: 4 Like Comment Share See more on Facebook Email address or phone number Password Log in Forgotten password? or Create new account"
                }
            ]
        }
    ]
}